In [1]:
import pandas as pd
import numpy as np

In [2]:
# 쯈u칠 diferencia hay entre una Serie y un Dataframe?
# La serie tiene una dimensi칩n y el DataFrame tiene dos

In [3]:
# Momento de trabajar con Series. Contestas las siguientes preguntas:
# Crea dos listas:
# Una que se llame "valores" que tenga 7 n칰meros aleatorios.
# Otra que se llame "indices" que tenga 7 strings que se llamen como los dias de la semana.

In [4]:
valores = np.random.randint(0,15, (7))
indices = ["Lunes", "Martes", "Miercoles", "Jueves", "Viernes", "Sabado", "Domingo"]

In [5]:
# A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie 
# y la variable indices sean los 칤ndices de la Serie.

serie = pd.Series(valores, indices)
serie

Lunes         7
Martes        4
Miercoles    10
Jueves        3
Viernes       3
Sabado        8
Domingo      11
dtype: int64

In [6]:
# A partir de las dos listas anteriores crea un diccionario usando un for. 
# Para hacer esto tenemos el m칠todo zip que nos permite iterar por dos listas a la vez. M치s informci칩n sobre este m칠todo aqu칤.


diccionario_global = {}
for key,value in zip(indices, valores):   
    diccionario = {key:value}                             #podr칤amos evitar variable diccionario
    diccionario_global.update(diccionario)
print(diccionario_global)

{'Lunes': 7, 'Martes': 4, 'Miercoles': 10, 'Jueves': 3, 'Viernes': 3, 'Sabado': 8, 'Domingo': 11}

In [7]:
# Crea una Serie con el diccionario creado en el punto anterior.

serie_diccionario = pd.Series(diccionario_global)
serie_diccionario

Lunes         7
Martes        4
Miercoles    10
Jueves        3
Viernes       3
Sabado        8
Domingo      11
dtype: int64

In [8]:
# Forma, tama침o, 칤ndices y values
print("Esta es la forma de nuestra serie", serie_diccionario.shape)

Esta es la forma de nuestra serie (7,)

In [9]:
print("Este es el tipo de nuestra serie" , serie_diccionario.dtypes)

Este es el tipo de nuestra serie int64

In [10]:
print("Este es el tama침o de nuestra serie", serie_diccionario.size)

Este es el tama침o de nuestra serie 7

In [11]:
print("Estos son los valores de nuestra serie", serie_diccionario.values)

Estos son los valores de nuestra serie [ 7  4 10  3  3  8 11]

In [12]:
# Extraed el valor para el 칤ndice "lunes"

serie_diccionario["Lunes"]

7

SyntaxError: unmatched ')' (1293910769.py, line 1)

In [16]:
# Extraed el valor para el 칤ndice "lunes", "martes" y "mi칠rcoles"

serie_diccionario["Lunes":"Miercoles"]

Lunes         7
Martes        4
Miercoles    10
dtype: int64

In [ ]:
# Extraed el valor para el 칤ndice "lunes" y "domingo"
serie_diccionario["Lunes"], serie_diccionario["Domingo"]

(14, 7)

In [17]:
serie_diccionario["Lunes":"Domingo"]

Lunes         7
Martes        4
Miercoles    10
Jueves        3
Viernes       3
Sabado        8
Domingo      11
dtype: int64

DataFrames

In [ ]:
# Cread un array de dos dimensiones con 4 filas y 3 columnas.
array_df = np.random.randint(0,100,(4,3))
dataframe = pd.DataFrame(array_df)
dataframe

    0   1   2
0  53  75  20
1  35  84  68
2  45  62  28
3  14  72  62

In [ ]:
# Convertid el array en un dataframe donde las columnas se llamen "Espa침a", "Francia" e "Italia".
dataframe.rename(columns = {0:"Espa침a", 1:"Francia", 2:"Italia"}, inplace = True)
dataframe

   Espa침a  Francia  Italia
0      53       75      20
1      35       84      68
2      45       62      28
3      14       72      62

In [ ]:
# Descargad el archivo "medallas" y cargad el dataframe con la siguiente l칤ena de c칩digo:
# df = pd.read_csv("medallas.csv", index_col=0)
df = pd.read_csv("medallas.csv", index_col=["Pa칤s"])
df.head()

               Unnamed: 0   Oro  Plata  Bronce
Pa칤s
China                   1  1473    994     720
Jap칩n                   2  1032   1037     985
Corea del Sur           3   745    663     827
Ir치n                    4   179    181     197
Kazajist치n              5   155    158     224

In [ ]:
df.drop(columns= "Unnamed: 0", inplace= True)

In [ ]:
# 游늷 NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura que el jupyter donde estamos trabajando.
# Usando el loc extraed todas las columnas de la fila.
df.loc["China",:]

Oro       1473
Plata      994
Bronce     720
Name: China, dtype: int64

In [ ]:
# Usando el loc extraed todas las columnas de China e Ir치n.
df.loc[["China","Ir치n"],:]

        Oro  Plata  Bronce
Pa칤s
China  1473    994     720
Ir치n    179    181     197

In [ ]:
# Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Ir치n.
df.loc[["China","Ir치n"],["Oro", "Plata", "Bronce"]]

        Oro  Plata  Bronce
Pa칤s
China  1473    994     720
Ir치n    179    181     197

In [ ]:
lista= list(df.index)
india = lista.index("India")

In [ ]:
# Usando el iloc extraed la informaci칩n de la India. Devolved todas las columnas
df.iloc[india,:]

Oro       154
Plata     202
Bronce    315
Name: India, dtype: int64

In [ ]:
# Usando el iloc extraed todas las columnas de los paises que est칠n en posici칩n impar. 
# La primera que nos tendr칤a que salir es Jap칩n y la 칰ltima Corea del Norte.

df.iloc[1:10:2]

# 游꺙asumimos posici칩n impar como 칤ndice impar

                  Oro  Plata  Bronce
Pa칤s
Jap칩n            1032   1037     985
Ir치n              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [ ]:
df.shape

(10, 3)

In [ ]:
#comprobando que son los pa칤ses impares
df

                  Oro  Plata  Bronce
Pa칤s
China            1473    994     720
Jap칩n            1032   1037     985
Corea del Sur     745    663     827
Ir치n              179    181     197
Kazajist치n        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taip칠i       99    144     276
Corea del Norte    91    120     235

In [ ]:
# Utilizando el c칩digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".
df.iloc[1:10:2,1:4]

                  Oro  Plata  Bronce
Pa칤s
Jap칩n            1032   1037     985
Ir치n              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

In [ ]:
# 쯈u칠 pa칤s consigui칩 m치s de 200 medallas de oro?
df.loc[df.Oro > 200,:]

               Unnamed: 0   Oro  Plata  Bronce
Pa칤s
China                   1  1473    994     720
Jap칩n                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [ ]:
# 쯈u칠 pa칤s consigui칩 m치s de 200 medallas de oro y m치s de 1000 de plata?
df.loc[(df.Oro > 200) & (df.Plata > 1000)]

       Unnamed: 0   Oro  Plata  Bronce
Pa칤s
Jap칩n           2  1032   1037     985

In [ ]:
# 쯈u칠 pa칤s consigui칩 m치s de 200 medallas de oro o m치s de 700 de bronce?
df.loc[(df.Oro > 200) | (df.Plata > 700)]

               Unnamed: 0   Oro  Plata  Bronce
Pa칤s
China                   1  1473    994     720
Jap칩n                   2  1032   1037     985
Corea del Sur           3   745    663     827

In [ ]:
# Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.
df2 = df.copy()

In [ ]:
# df2.drop(df2.loc("Unnamed: 0"))
df2.drop("Unnamed: 0", inplace=True, axis=1) 
df2

                  Oro  Plata  Bronce
Pa칤s
China            1473    994     720
Jap칩n            1032   1037     985
Corea del Sur     745    663     827
Ir치n              179    181     197
Kazajist치n        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taip칠i       99    144     276
Corea del Norte    91    120     235

In [ ]:
# Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada pa칤s.
df["Total"] = (df["Oro"]+ df["Plata"] + df["Bronce"])
df

                 Unnamed: 0   Oro  Plata  Bronce  Total
Pa칤s
China                     1  1473    994     720   3187
Jap칩n                     2  1032   1037     985   3054
Corea del Sur             3   745    663     827   2235
Ir치n                      4   179    181     197    557
Kazajist치n                5   155    158     224    537
India                     6   154    202     315    671
Tailandia                 7   132    175     278    585
Indonesia                 8   112    131     240    483
China Taip칠i              9    99    144     276    519
Corea del Norte          10    91    120     235    446